#TODO 3.0 По введённым с клавиатуры росту человека в сантиметрах, обхвату грудной
# клетки в сантиметрах и массе тела в килограммах определить и вывести на
# экран нормальный вес человека 𝑚normal и индекс массы его тела BMI, полагая,

# h = input()
# t = input()
# m = input()
#
# try:
#     m_normal = float(h)*float(t)/240
#     BMI = float(m)/(float(h)/100)**2
#     # ошибка в задании, рост должен быть в метрах
#     print(m_normal, BMI)
# except:
#     print("Неверный формат данных!")

#TODO 3.1 . С клавиатуры вводится число литров 𝑉1 и температура 𝑇1 воды в первой ёмкости и число литров 𝑉2 и температура 𝑇2 воды во второй ёмкости, которые
# предстоит смешать. Найти и вывести на экран объём 𝑉 и температуру 𝑇 образовавшейся смеси.

# V1 = input()
# V2 = input()
# T1 = input()
# T2 = input()
#
# try:
#     V = float(V1) + float(V2)
#     T = (float(T1)*float(V1) + float(V2)*float(T2))/V
#     print(V, T)
#
# except:
#     print("Неверный формат данных!")

#TODO 3.2 C клавиатуры вводятся величины сопротивлений трёх резисторов, 𝑅1, 𝑅2, 𝑅3,
# соединённых параллельно. Найти и вывести на экран сопротивление 𝑅 всего соединения.

# R1 = input()
# R2 = input()
# R3 = input()
# try:
#     R = 1 /(1/float(R1) + 1/float(R2) + 1/float(R3))
#     print(R)
#
# except:
#     print("Неверный формат данных!")


#TODO 3.3 С клавиатуры вводится величины начальной скорости 𝑣0, ускорения 𝑎 и времени 𝑡 равноускоренного прямолинейного движения тела. Найти и вывести на
# # экран перемещение 𝑆.
#
# v0 = input()
# a = input()
# t = input()
#
# try:
#     S = float(v0)*float(t) + float(a)*float(t)**2/2
#     print(S)
#
# except:
#     print("Неверный формат данных!")

